#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bplab/gh-actions-demo/runs/run-GGxDuU3iNha5Bfu8

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.main: Refreshing state... [id=vpc-01ad7c3ce84734526]
aws_cloudwatch_log_group.bpcalc_stage_log_group: Refreshing state... [id=/ecs/BPCalc-Stage-app]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:119548518081:cluster/BPCalc-Stage]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=myEcsTaskExecutionRole]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=myEcsTaskExecutionRole-20211121212917045500000001]
aws_ecs_task_definition.app: Refreshing state... [id=BPCalc-task]
aws_cloudwatch_log_stream.bpcalc_stage_log_stream: Refreshing state... [id=BPCalc-Stage-log-stream]
aws_subnet.public[1]: Refreshing state... [id=subnet-07b7b49acb5050936]
aws_internet_gateway.gw: Refreshing state... [id=igw-0cb230f668d4a5b37]
aws_subnet.public[0]: Refreshing state... [id=subnet-038187ec96535790f]
aws_subnet.private[1]: Refreshing state... [id=subnet-00374ea7cded3b279]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:targetgroup/BPCalc-Stage-TG/c5006307e517d42a]
aws_subnet.private[0]: Refreshing state... [id=subnet-05f72ea602f664e67]
aws_security_group.lb: Refreshing state... [id=sg-0054b434cbad707cf]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01dd2d7124f6134b2]
aws_route.internet_access: Refreshing state... [id=r-rtb-0d9fba86d916bd3801080289494]
aws_eip.gw[0]: Refreshing state... [id=eipalloc-018ac4bd046aa487c]
aws_eip.gw[1]: Refreshing state... [id=eipalloc-01f2e6b5c22db8405]
aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:loadbalancer/app/BPCalc-Stage-LB/cd493deea9e740b6]
aws_nat_gateway.gw[1]: Refreshing state... [id=nat-016f6ecd87a24f7d8]
aws_nat_gateway.gw[0]: Refreshing state... [id=nat-0fb88a3078f3042cb]
aws_route_table.private[0]: Refreshing state... [id=rtb-0e192b7e137b87e3f]
aws_route_table.private[1]: Refreshing state... [id=rtb-0e19e34594a6e8ad8]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:listener/app/BPCalc-Stage-LB/cd493deea9e740b6/5156cf7c0cbb9193]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0162a72c0890e08fd]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04e7310c71cf302ce]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_subnet.public[0] has been changed
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-038187ec96535790f"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_subnet.public[1] has been changed
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-07b7b49acb5050936"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_nat_gateway.gw[0] has been changed
  ~ resource "aws_nat_gateway" "gw" {
        id                   = "nat-0fb88a3078f3042cb"
      + tags                 = {}
        # (5 unchanged attributes hidden)
    }
  # aws_nat_gateway.gw[1] has been changed
  ~ resource "aws_nat_gateway" "gw" {
        id                   = "nat-016f6ecd87a24f7d8"
      + tags                 = {}
        # (5 unchanged attributes hidden)
    }
  # aws_alb.main has been changed
  ~ resource "aws_alb" "main" {
        id                         = "arn:aws:elasticloadbalancing:eu-west-1:119548518081:loadbalancer/app/BPCalc-Stage-LB/cd493deea9e740b6"
        name                       = "BPCalc-Stage-LB"
      + tags                       = {}
        # (14 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }
  # aws_internet_gateway.gw has been changed
  ~ resource "aws_internet_gateway" "gw" {
        id       = "igw-0cb230f668d4a5b37"
      + tags     = {}
        # (3 unchanged attributes hidden)
    }
  # aws_alb_target_group.app has been changed
  ~ resource "aws_alb_target_group" "app" {
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:119548518081:targetgroup/BPCalc-Stage-TG/c5006307e517d42a"
        name                               = "BPCalc-Stage-TG"
      + tags                               = {}
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_subnet.private[1] has been changed
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-00374ea7cded3b279"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_subnet.private[0] has been changed
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-05f72ea602f664e67"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_iam_role.ecs_task_execution_role has been changed
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "myEcsTaskExecutionRole"
        name                  = "myEcsTaskExecutionRole"
      + tags                  = {}
        # (7 unchanged attributes hidden)
    }
  # aws_security_group.ecs_tasks has been changed
  ~ resource "aws_security_group" "ecs_tasks" {
        id                     = "sg-01dd2d7124f6134b2"
        name                   = "bpcalc-ecs-tasks-security-group"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }
  # aws_eip.gw[0] has been changed
  ~ resource "aws_eip" "gw" {
      + association_id       = "eipassoc-02d9b042df230ef20"
        id                   = "eipalloc-018ac4bd046aa487c"
      + network_interface    = "eni-02ec31adb125f071b"
      + private_dns          = "ip-172-17-2-34.eu-west-1.compute.internal"
      + private_ip           = "172.17.2.34"
      + tags                 = {}
        # (6 unchanged attributes hidden)
    }
  # aws_eip.gw[1] has been changed
  ~ resource "aws_eip" "gw" {
      + association_id       = "eipassoc-0afb0faa01b446330"
        id                   = "eipalloc-01f2e6b5c22db8405"
      + network_interface    = "eni-0893422b18a8a6064"
      + private_dns          = "ip-172-17-3-218.eu-west-1.compute.internal"
      + private_ip           = "172.17.3.218"
      + tags                 = {}
        # (6 unchanged attributes hidden)
    }
  # aws_vpc.main has been changed
  ~ resource "aws_vpc" "main" {
        id                               = "vpc-01ad7c3ce84734526"
      + tags                             = {}
        # (14 unchanged attributes hidden)
    }
  # aws_security_group.lb has been changed
  ~ resource "aws_security_group" "lb" {
        id                     = "sg-0054b434cbad707cf"
        name                   = "bpcalc-stage-load-balancer-security-group"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }
  # aws_ecs_cluster.main has been changed
  ~ resource "aws_ecs_cluster" "main" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:eu-west-1:119548518081:cluster/BPCalc-Stage"
        name               = "BPCalc-Stage"
      + tags               = {}
        # (1 unchanged attribute hidden)
    }
  # aws_route_table.private[1] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e19e34594a6e8ad8"
      + tags             = {}
        # (4 unchanged attributes hidden)
    }
  # aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e192b7e137b87e3f"
      + tags             = {}
        # (4 unchanged attributes hidden)
    }
  # aws_ecs_task_definition.app has been changed
  ~ resource "aws_ecs_task_definition" "app" {
        id                       = "BPCalc-task"
      + tags                     = {}
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.down will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "BPCalc_Stage_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.up will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "BPCalc_Stage_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # aws_appautoscaling_target.target will be created
  + resource "aws_appautoscaling_target" "target" {
      + id                 = (known after apply)
      + max_capacity       = 6
      + min_capacity       = 3
      + resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "BPClac_Stage_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "BPCalc-Stage"
          + "ServiceName" = "BPCalc-StageRolling"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "BPCalc_Stage_cpu_utilization_low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "BPCalc-Stage"
          + "ServiceName" = "BPCalc-StageRolling"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:eu-west-1:119548518081:cluster/BPCalc-Stage"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "BPCalc-StageRolling"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "BPCalc-app"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:119548518081:targetgroup/BPCalc-Stage-TG/c5006307e517d42a"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-01dd2d7124f6134b2",
            ]
          + subnets          = [
              + "subnet-00374ea7cded3b279",
              + "subnet-05f72ea602f664e67",
            ]
        }
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:119548518081:task-definition/BPCalc-task:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ name             = "cb-app" -> "BPCalc-app"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "BPCalc-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @davidpmahon, Action: `pull_request`*